app/controllers/categories_controller.rb

  def index
    @categories = Category.all
    @prices = Price.all
---
SELECT "categories".* FROM "categories"
SELECT "prices".* FROM "prices"

  def new
    @category = Category.new
    @parents = Category.all
---
SELECT "categories".* FROM "categories"

  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("created_at", "name", "parent_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 02 Jul 2012 13:24:03 UTC +00:00], ["name", "суп"], ["parent_id", nil], ["updated_at", Mon, 02 Jul 2012 13:24:03 UTC +00:00]]

  def update
    @category = Category.find(params[:id])

    respond_to do |format|
      if @category.update_attributes(params[:category])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", "6"]]
UPDATE "categories" SET "parent_id" = -2, "updated_at" = '2012-08-09 10:45:36.114158' WHERE "categories"."id" = 6