app/controllers/prices_controller.rb

  def index
    @prices = Price.all
---
SELECT "prices".* FROM "prices"

  def show
    @price = Price.find(params[:id])
---
SELECT "prices".* FROM "prices" WHERE "prices"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @price = Price.find(params[:id])
---
SELECT "prices".* FROM "prices" WHERE "prices"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @price = Price.new(params[:price])

    respond_to do |format|
      if @price.save
---
INSERT INTO "prices" ("category_id", "created_at", "sum", "updated_at") VALUES (?, ?, ?, ?)  [["category_id", 2], ["created_at", Wed, 04 Jul 2012 07:16:05 UTC +00:00], ["sum", 500.0], ["updated_at", Wed, 04 Jul 2012 07:16:05 UTC +00:00]]